using System;

namespace Group323TOP
{
    class Program
    {
        // 0. Создать метод для нахождения суммы элементов двух одномерных массивов.
        // 1. Создать перегрузку предыдущеко метода, для нахождения произведения элементов двух одномерных массивов
        // 2. найти максимальный элемент в каждой строке матрицы
        static void Main(string[] args)
        {
            int[] mas1 = new int[10];
            for (int i = 5; i < mas1.Length; i++)
            {
                Console.WriteLine(i);
            }
        }
    }
}
